In [43]:
import pandas as pd
from decimal import Decimal

In [7]:
data_dir = '/Users/annagreene/code/district-comparison/data/'

In [26]:
mapping = pd.read_csv(data_dir + 'final_mapping.csv')
raw_dist = pd.read_csv(data_dir + 'raw/arizonaExample.csv')

,Active,Account,Description,Account Type,Budget Control Group,Budget,YTD Transactions,Balance,Encumbrance,Budget Balance,Pre Encumbrance,Pending Invoices,Uncommitted Balance
0,True,001.000.0000.0100.000.000. 002,CASH,ASSET,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00
1,True,001.000.0000.0100.000.000.0000,CASH,ASSET,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00
2,True,001.000.0000.0102.000.000.0000,CASH IN BANK,ASSET,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00
3,True,001.000.0000.0103.000.000.0000,CASH ON DEP/COUNTY TREASR,ASSET,NaN,$0.00,"$63,322,851.07","-($63,322,851.07)",$0.00,"-($63,322,851.07)",$0.00,$0.00,"-($63,322,851.07)"
4,True,001.000.0000.0144.000.000.0000,STATE,ASSET,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
64642,True,965.630.1000.6221.202.000.0000,SOCIAL SECURITY-OASDI,EXPENDITURE,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00
64643,True,965.630.1000.6222.202.000.0000,MEDICARE,EXPENDITURE,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00
64644,True,965.630.1000.6231.202.000.0000,STATE RETIREMENT,EXPENDITURE,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00
64645,True,965.630.1000.6232.202.000.0000,LONG-TERM DISABILITY,EXPENDITURE,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00
64646,True,965.630.1000.6260.202.000.0000,WORKERS' COMPENSATION,EXPENDITURE,NaN,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00,$0.00

In [83]:
raw_dist["Object_code"] = 0
raw_dist["Object_code"] = raw_dist.Account.str.split(".").str[3]
dist = raw_dist[raw_dist['Account Type']=="EXPENDITURE"]
dist = dist.drop(columns=['Active', 'Account', 'Description', 'Account Type', 'Budget Control Group', 'Budget', 'Budget Balance','Balance', 'Encumbrance', 'Pre Encumbrance', 'Pending Invoices', 'Uncommitted Balance'])
replace = [',', '$', '-', '(', ')']
dist['YTD Transactions'] = dist['YTD Transactions'].str.translate({ord(x): '' for x in replace}).astype(float)
dist = dist.groupby(['Object_code'])['YTD Transactions'].sum().reset_index()
dist = dist.rename(columns={'YTD Transactions': 'Transactions'})
dist

    Object_code  Transactions
0          6000          0.00
1          6100          0.00
2          6101          0.00
3          6103          0.00
4          6110       8002.11
..          ...           ...
181        6890     455508.18
182        6891          0.00
183        6892          0.00
184        6893          0.00
185        6899          0.00

[186 rows x 2 columns]

    Object_code  YTD Transactions
0          6000              0.00
1          6100              0.00
2          6101              0.00
3          6103              0.00
4          6110           8002.11
..          ...               ...
181        6890         455508.18
182        6891              0.00
183        6892              0.00
184        6893              0.00
185        6899              0.00

[186 rows x 2 columns]